config.org
#+TITLE:  Zacque's Literate Emacs Config
#+AUTHOR: Lee Jia Hong
#+EMAIL:  jia_hong@live.com.my
#+DATE:   [2018-06-09 Sat]
#+TAGS:   literate emacs config dotfile

* Introduction

This is an attempt to put my Emacs config into an org file. By doing so, my init.el file will contains only two lines of code:

#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el :results none
;;; init.el --- Where all the magic begins. -*- lexical-binding: t -*-

;;; COMMENTARY:
;;----------------------------------------------------------------------------
;;    ___ _ __ ___   __ _  ___ ___
;;   / _ \ '_ ` _ \ / _` |/ __/ __|
;;  |  __/ | | | | | (_| | (__\__ \
;; (_)___|_| |_| |_|\__,_|\___|___/
;;
;;  Citations
;;
;;     "Show me your ~/.emacs and I will tell you who you are."
;;                                                         [Bogdan Maryniuk]
;;
;;     "Emacs is like a laser guided missile. It only has to be slightly
;;      mis-configured to ruin your whole day."
;;                                                            [Sean McGrath]
;;
;;     "While any text editor can save your files, only Emacs can save your
;;      soul."
;;                                                          [Per Abrahamsen]
;;
;; Source: http://www.mygooglest.com/fni/dot-emacs.html
;;----------------------------------------------------------------------------

;;----------------------------------------------------------------------------
;;
;;                __   _,--="=--,_   __
;;               /  \."    .-.    "./  \
;;              /  ,/  _   : :   _  \/` \
;;              \  `| /o\  :_:  /o\ |\__/
;;               `-'| :="~` _ `~"=: |
;;                  \`     (_)     `/
;;           .-"-.   \      |      /   .-"-.
;;      .---{     }--|  /,.-'-.,\  |--{     }---.
;;       )  (_)_)_)  \_/`~-===-~`\_/  (_(_(_)  (
;;      (                                       )
;;       )          Recreating Purcell         (
;;      (            Emacs Experience           )
;;       )                                     (
;;      '---------------------------------------'
;;
;;----------------------------------------------------------------------------

;;; CODE:
;; SOURCE: https://github.com/jamiecollinson/dotfiles/blob/master/.emacs
(org-babel-load-file (concat user-emacs-directory "config.org"))

(provide 'init)
;; Local Variables:
;; coding: utf-8
;; no-byte-compile: t
;; End:

;;; init.el ends here
#+END_SRC

The rest is in the config.org file.

* Header

#+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t; -*-
#+END_SRC

* Personalise

Add my personal info.

#+BEGIN_SRC emacs-lisp
(setq user-full-name    "Lee Jia Hong")
(setq user-mail-address "jia_hong@live.com.my")
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; UI Settings
(setq inhibit-startup-screen t)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(menu-bar-mode -1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
(add-hook 'after-init-hook 'mode-line-bell-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-visual-line-mode 1) ;; wrap line
(with-eval-after-load 'diminish  ;; diminish library is loaded after this line
  (diminish 'visual-line-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Make sure C-v and M-v returns cursor to the same position.

#+BEGIN_SRC emacs-lisp
(setq scroll-preserve-screen-position 'always)
#+END_SRC

Like VIM, make my Emacs files display tildes after EOF [fn:5].

#+BEGIN_SRC emacs-lisp
(setq-default indicate-empty-lines t)
(define-fringe-bitmap 'tilde [0 0 0 113 219 142 0 0] nil nil 'center)
(setcdr (assq 'empty-line fringe-indicator-alist) 'tilde)
(set-fringe-bitmap-face 'tilde 'font-lock-function-name-face)
#+END_SRC

Customise Emacs startup page. This is useful to kick start my day.

#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice "~/focus.txt")
#+END_SRC

** UTF-8 Everywhere

Setup to have UTF-8 everywhere? To display Chinese fonts in TTY.

#+BEGIN_SRC emacs-lisp
(defun sanityinc/utf8-locale-p (v)
  "Return whether locale string V relates to a UTF-8 locale."
  (and v (string-match "UTF-8" v)))

(defun sanityinc/locale-is-utf8-p ()
  "Return t iff the \"locale\" command or environment variables prefer UTF-8."
  (or (sanityinc/utf8-locale-p (and (executable-find "locale") (shell-command-to-string "locale")))
      (sanityinc/utf8-locale-p (getenv "LC_ALL"))
      (sanityinc/utf8-locale-p (getenv "LC_CTYPE"))
      (sanityinc/utf8-locale-p (getenv "LANG"))))

(when (or window-system (sanityinc/locale-is-utf8-p))
  (set-language-environment 'utf-8)
  (setq locale-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-selection-coding-system (if (eq system-type 'windows-nt) 'utf-16-le 'utf-8))
  (prefer-coding-system 'utf-8))
#+END_SRC

** Setup my Emacs.d Structure
  
Configure my directory location.

#+BEGIN_SRC emacs-lisp
(defconst jh/emacs-directory (concat (getenv "HOME") "/.emacs.d/"))
(defun jh/emacs-subdirectory (d) (expand-file-name d jh/emacs-directory))
#+END_SRC

Create directory if not already created. Got the code from [[https://github.com/howardabrams/dot-files/blob/master/emacs.org#directory-structure][here]].

#+BEGIN_SRC emacs-lisp
(let* ((subdirs '("lisp" "backups" "themes"))
       (fulldirs (mapcar (lambda (d) (jh/emacs-subdirectory d)) subdirs)))
  (dolist (dir fulldirs)
    (when (not (file-exists-p dir))
      (message "Make directory: %s" dir)
      (make-directory dir))))
#+END_SRC

*** Move the Custom Variables into a Dedicated File

To prevent custom variable form cluttering the init.el file.
#+BEGIN_SRC emacs-lisp
(defconst custom-file "~/.emacs.d/custom.el")
(unless (file-exists-p custom-file)
  (shell-command (concat "touch " custom-file)))
(setq custom-file custom-file)
(load custom-file)
#+END_SRC

*** Define the Backup Directory
  
#+BEGIN_SRC emacs-lisp
;; Sensible Backups
(setq backup-directory-alist '(("." . "~/.emacs.d/backups"))
      backup-by-copying t       ; Don't delink hardlinks
      version-control t         ; Use version numbers on backups
      delete-old-versions t     ; Automatically delete excess backups
      kept-new-versions 20      ; Number of newest versions to keep
      kept-old-versions 5       ; Number of the old versions to keep
      vc-make-backup-files t)   ; Make backups file even from a version controlled dir
#+END_SRC

** Better buffer name conflict resolution

=uniquify= package provides a better way to resolve buffer name conflicts to the default way. Yet defer its loading since I won't often open files with identical names.

#+BEGIN_SRC emacs-lisp
(require 'uniquify)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq uniquify-buffer-name-style 'reverse)
(setq uniquify-separator " • ")
(setq uniquify-after-kill-buffer-p t)
(setq uniquify-ignore-buffers-re "^\\*")
#+END_SRC

** Emacs Theme

#+BEGIN_SRC emacs-lisp :tangle no
(load-theme 'leuven t)
#+END_SRC

Dark mode.
#+BEGIN_SRC emacs-lisp
(load-theme 'manoj-dark t)
#+END_SRC

** Default Font

Express a font name using a Fontconfig pattern [fn:27]:
#+BEGIN_QUOTE
fontname[-fontsize][:name1=value1][:name2=value2]...
#+END_QUOTE
where nameN can be one of 'slant', 'weight', 'style', width', and 'spacing.

Override the default font in Emacs to using Overpass Mono developed by Redhat [fn:26].
#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(font . "Overpass Mono"))
#+END_SRC

** Display Relative Line Numbers

Get the code from the web [fn:1].
#+BEGIN_SRC emacs-lisp
;; Display Relative Line Numbers for Easy Vim Editing
(setq-default display-line-numbers 'visual
	      display-line-numbers-current-absolute t
	      display-line-numbers-width 4
	      display-line-numbers-widen t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'prog-mode-hook #'display-line-numbers-mode)
#+END_SRC

Define a function to make it easy to disable page number display inside a mode. It is used in pdf-view-mode.
#+BEGIN_SRC emacs-lisp
(defun display-line-numbers-disable-hook ()
  "Disable display-line-numbers locally."
  (display-line-numbers-mode -1))
#+END_SRC

* Utility Code

These are some useful utility codes taken from Purcell.

#+BEGIN_SRC emacs-lisp
(if (fboundp 'with-eval-after-load)
    (defalias 'after-load 'with-eval-after-load)
  (defmacro after-load (feature &rest body)
    "After FEATURE is loaded, evaluate BODY."
    (declare (indent defun))
    `(eval-after-load ,feature
       '(progn ,@body))))
#+END_SRC

Emacs GC optimisation, according to [fn:23].

#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold 20000000)
#+END_SRC

* Manage Packages and Sources
** Add Package Source

Add melpa as a package source.

#+BEGIN_SRC emacs-lisp
(require 'package)
(package-initialize)

(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
#+END_SRC

Add third-party library from the ./lisp directory. This is especially useful if I clone the library from Github and work on it. Since all .el files reside in one level deep in lisp directory, I will need to add all the subdirectory to the load path.

#+BEGIN_SRC emacs-lisp
;; A helper function
;; Source: https://stackoverflow.com/a/17165074
(defun my-directory-files (directory &optional full match nosort)
  "Like `directory-files', but excluding \".\" and \"..\"."
  (let* ((files (cons nil (directory-files directory full match nosort)))
         (parent files)
         (current (cdr files))
         (exclude (list "." ".."))
         (file nil))
    (while (and current exclude)
      (setq file (car current))
      (if (not (member file exclude))
          (setq parent current)
        (setcdr parent (cdr current))
        (setq exclude (delete file exclude)))
      (setq current (cdr current)))
    (cdr files)))
#+END_SRC

With the helper function, =(my-directory-files ~/.emacs.d/lisp)= should return a result containing all the directory in lisp as a list. With this, I will only need to loop through the list and add each subdirectory path to the =load-path=.

#+BEGIN_SRC emacs-lisp
(dolist (subdir (my-directory-files "~/.emacs.d/lisp"))
  (add-to-list 'load-path (expand-file-name (concat "lisp/" subdir) user-emacs-directory)))
#+END_SRC

** ELPA Public Key

#+BEGIN_SRC emacs-lisp
;; Set GPG Directory for ELPA Public Key
(setq package-gnupghome-dir "~/.gnupg")
#+END_SRC

** Require-package
  
#+BEGIN_SRC emacs-lisp
(defun require-package (package &optional min-version no-refresh)
  "Install given PACKAGE, optionally requiring MIN-VERSION.
If NO-REFRESH is non-nil, the available package lists will not be
re-downloaded in order to locate PACKAGE."
  (or (package-installed-p package min-version)
      (let* ((known (cdr (assoc package package-archive-contents)))
             (versions (mapcar #'package-desc-version known)))
        (if (cl-find-if (lambda (v) (version-list-<= min-version v)) versions)
            (package-install package)
          (if no-refresh
              (error "No version of %s >= %S is available" package min-version)
            (package-refresh-contents)
            (require-package package min-version t))))))
#+END_SRC

** External Program Dependencies

As my Emacs is tightly integrated with my OS (Arch Linux/Ubuntu), there are libraries that will not work if the executable is not found.

Check if an executable is installed.
#+BEGIN_SRC emacs-lisp
(defun check-executable-is-installed (exe &optional msg)
  "Check if an executable is installed."
  (unless (executable-find exe)
    (message (concat "'" exe "' not found. " msg))))
#+END_SRC

[TODO] If the executable is not installed, install them at Emacs boot up.
#+BEGIN_SRC emacs-lisp :tangle no

#+END_SRC

* Utility Third Library

Display some windows into "full-screen" mode.
#+BEGIN_SRC emacs-lisp
(require-package 'fullframe)
#+END_SRC

Display ugly ^L page breaks as tidy horizontal lines.
#+BEGIN_SRC emacs-lisp
(require-package 'page-break-lines)
(global-page-break-lines-mode)

(with-eval-after-load 'diminish ;; diminish library is loaded after this line
  (diminish 'page-break-lines-mode))
#+END_SRC

Provides a command which searches for unicode characters by name, and displays a list of matching characters with their names in a buffer.
#+BEGIN_SRC emacs-lisp
(require-package 'list-unicode-display)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require-package 'wgrep)
#+END_SRC

A useful tool to hide/redefine mode indicator at the mode line.
#+BEGIN_SRC emacs-lisp
(require-package 'diminish)
#+END_SRC

** Wgrep

#+BEGIN_SRC emacs-lisp
(require-package 'wgrep)
#+END_SRC

** Ripgrep

rg is an Emacs interface to =ripgrep=. This package interoperates well with =wgrep=. Similar: =deadgrep=.
#+BEGIN_SRC emacs-lisp
(require-package 'rg)
(with-eval-after-load 'evil
  (evil-set-initial-state 'rg-mode 'emacs))
#+END_SRC

#+NAME: Ripgrep Package
#+BEGIN_SRC emacs-lisp
(require-package 'ripgrep) ;; for integration with projectile.
#+END_SRC

Use -i for case insensitive.
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'counsel
  (setq counsel-rg-base-command "rg -i --no-heading --line-number --color never %s"))
#+END_SRC

References:
1. https://oremacs.com/2018/03/05/grep-exclude/
   For counsel-rg-base-command idea.
2. https://github.com/dajva/rg.el

Advanced undo and redo with =undo-tree=.
#+BEGIN_SRC emacs-lisp
(require-package 'undo-tree)
(diminish 'undo-tree-mode)

;; turn on everywhere
(global-undo-tree-mode 1)
#+END_SRC

A handy tool to restart emacs, especially when using EXWM.
#+BEGIN_SRC emacs-lisp
(require-package 'restart-emacs)
#+END_SRC

A useful tool to alert from the mode-line.
#+BEGIN_SRC emacs-lisp
(require-package 'mode-line-bell)
#+END_SRC

* Editing Utilities

This is where I put codes that help with editing in general, no matter what the language be.

#+BEGIN_SRC emacs-lisp
#+END_SRC

